In [1]:
import numpy as np
import pandas as pd

In [2]:
from faker.providers.person.en import Provider

In [11]:
names_list = ['Adam', 'Eve', 'Steve', 'Rogers','Mohan', 'Vivek', 'Tony']
tidy_data = pd.DataFrame(names_list)
tidy_data

        0
0    Adam
1     Eve
2   Steve
3  Rogers
4   Mohan
5   Vivek
6    Tony

In [13]:
purchase_col = [123,456,789]
df_train=pd.DataFrame(purchase_col)
df_train.columns = ['Purchase']
df_train

   Purchase
0       123
1       456
2       789

In [16]:
from sklearn.impute import SimpleImputer

imp=SimpleImputer(strategy="median",missing_values=np.nan)
imp.fit(df_train[['Purchase']])

SimpleImputer(strategy='median')